app/Controllers/Api/ExcursionController.php

SELECT *
FROM `excursion`
---
	public function listExcursion()
	{
		$exc = new ExcursionModel();

        //log_message('error', $e->getMessage());

		$response = [
			'status' => 200,
			"error" => false,
			'messages' => 'Excursion list',
			'data' => $exc->findAll()